taskt/Core/Automation/Commands/UIAutomationGroup/AUIElementActionCommands_[%reverse%].puml
@startuml
package "taskt.Core.Automation.Commands"{
class "UIAutomationScrollPercentUIElementCommand" <<sealed>> {
+RunCommand() : void 
+v_ScrollBarType : String <<get>> <<set>> 
+v_ScrollValue : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands.UIAutomationGroup"{
abstract class "AUIElementActionCommands"{
+v_ActivateWindowBeforeAction : String <<get>> <<set>> 
+v_WaitTimeBeforeAction : String <<get>> <<set>> 
+v_WaitTimeAfterAction : String <<get>> <<set>> 
+v_WhenActionIsNotSupported : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "UIAutomationSetSelectedStateToUIElementCommand" <<sealed>> {
+RunCommand() : void 
+v_State : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "UIAutomationClickUIElementCommand" <<sealed>> {
+RunCommand() : void 
+v_ClickType : String <<get>> <<set>> 
+v_XOffset : String <<get>> <<set>> 
+v_YOffset : String <<get>> <<set>> 
+v_ActivateWindowBeforeAction : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "UIAutomationExpandCollapseItemsInUIElementCommand" <<sealed>> {
+RunCommand() : void 
+v_ItemsState : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "UIAutomationScrollUIElementCommand" <<sealed>> {
+RunCommand() : void 
+v_ScrollBarType : String <<get>> <<set>> 
+v_DirectionAndAmount : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "UIAutomationSelectItemInUIElementCommand" <<sealed>> {
+RunCommand() : void 
+v_Item : String <<get>> <<set>> 
+v_ItemValueType : String <<get>> <<set>> 
+v_ExpandWhenItemsNotFound : String <<get>> <<set>> 
+v_WaitTimeAfterExpand : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "UIAutomationSelectUIElementCommand" <<sealed>> {
+RunCommand() : void 
}
}

package "taskt.Core.Automation.Commands"{
class "UIAutomationSetTextToUIElementCommand" <<sealed>> {
+RunCommand() : void 
+v_TextToSet : String <<get>> <<set>> 
}
}


taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationScrollPercentUIElementCommand
taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationSetSelectedStateToUIElementCommand
taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationClickUIElementCommand
taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationExpandCollapseItemsInUIElementCommand
taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationScrollUIElementCommand
taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationSelectItemInUIElementCommand
taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationSelectUIElementCommand
taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionCommands <|-- taskt.Core.Automation.Commands.UIAutomationSetTextToUIElementCommand
@enduml
